#4.1. Перемістити всі нулі до кінця списку
#Написати програму, яка переміщає всі нулі у кінець списку.
#Ваше завдання — змінити список так, щоб усі нулі опинилися наприкінці списку.
#Порядок ненульових чисел має зберегтися!

#import random

#lst = []

# for j in range(10):
#     lst.append(random.randint(0,10))
#
# print(lst)
#
# i = 0
#
# for element in lst:
#     if element == 0:
#         lst.remove(element)
#         lst.append(0)
#         i += 1
#     else:
#         continue
#
# print(lst)


# 4.2. Знайти суму елементів із парними індексами
# Для списку цілих чисел потрібно знайти суму елементів із парними індексами [0-й, 2-й, 4-й ітд], потім перемножити цю суму на останній елемент вхідного масиву.
# Не забудьте, що перший елемент масиву має індекс 0.
# Для порожнього масиву результат завжди 0.

# lst = [0, 1, 7, 2, 4, 8]
#
# if len(lst) == 0:
#     result = 0
# else:
#     s = 0
#     for i in range(0, len(lst), 2):
#         s += lst[i]
#     result = s * lst[-1]
#
# print(result)


# 4.3. Список із 3 елементів
# 1. Необхідно створити список випадкових чисел із випадковою кількістю елементів від 3 до 10.
# 2. Створить інший список з 3 елементів зі списку з п.1 - першим, третім і другим з кінця.


# import random
#
# lst = []
#
# length = random.randint(3, 10)
#
# for i in range(length):
#     lst.append(random.randint(0, 10))
#
# lst1 = [lst[0], lst[2], lst[-2]]
#
# print(lst)
# print(lst1)

