#1. Квадрат числа.
#Користувач вводить число. Програма виводить його квадрат.
#Приклад:
#Введіть число: 5
#Квадрат числа: 25

#num = int(input("Введіть число для піднесення до квадрату: "))
#result = num * num

#print(f"Квадрат числа {num} : {result}")

#2. “Середнє трьох чисел”
#Програма запитує три числа і виводить їх середнє арифметичне.
#Приклад:
#Введіть три числа: 2, 4, 6
#Середнє: 4.0

#num = int(input("Введіть 1 число: "))
#num2 = int(input("Введіть 2 число: "))
#num3 = int(input("Введіть 3 число: "))

#result = (num + num2 + num3) / 3
#print(f"Середнє трьох чисел {num}, {num2}, {num3}: {result}")

#3. “Перетворення хвилин у години”
#№Користувач вводить кількість хвилин. Програма виводить, скільки це годин і хвилин.
#Приклад:
#Введіть кількість хвилин: 135
#2 години 15 хвилин

#minutes = int(input("Введіть кількість хвилин: "))

#result_hour = minutes // 60
#result_minutes = minutes % 60
#print(f"Це {result_hour} годин {result_minutes} хвилин")

#4. “Розрахунок знижки”
#Користувач вводить ціну товару і розмір знижки у %.
#програма виводить кінцеву ціну.
#Приклад:
#Введіть ціну: 1000
#Введіть знижку (%): 15
#Ціна зі знижкою: 850.0

#price = int(input("Введіть ціну товару: "))
#discount = int(input("Введіть знижку (%): "))

#result = price - ((price * discount) / 100)
#print(f"Ціна зі знижкою {result}")

#5. “Остання цифра числа”
#Користувач вводить ціле число, програма виводить його останню цифру.
#Приклад:
#Введіть число: 347
#Остання цифра: 7

#num = int(input("Введіть число: "))

#result = num % 10
#print(f"Остання цифра числа {num}: {result}")

#6. “Периметр прямокутника”
#Користувач вводить довжину і ширину. Програма виводить периметр.
#Приклад:
#Введіть довжину: 5
#Введіть ширину: 3
#Периметр: 16

#length =int(input("Введіть довжину: "))
#width = int(input("Введіть ширину: "))

#result = (length + width) * 2
#print(f"Периметр прямокутника: {result}")

#7. Виведення числа в стовпчик
#Написати програму, яка просить користувача ввести 4-х значне число з клавіатури, після чого друкує на екрані стовпчик цифр, з якого це число складається. Наприклад, користувач вводить 1234, а програма виводить:
#1
#2
#3
#4
#Завдання необхідно вирішити, використовуючи методи поділу (підказка // і % або divmod). Виведення в стовпчик можна зробити за допомогою 4-х функцій print.
#Користувач може ввести будь-яке 4 значне ціле число. Будь-яке 4-х значне число - це число, яке складається з 4-х цифр, де кожна цифра може бути від 0 до 9 включно.
#Ваше рішення має це враховувати! Якщо користувач ввів не ціле число, це проблема користувача, а не вашої програми.
#Створюйте рішення, виходячи з того, що число ЗАВЖДИ 4-х значне.

#num = int(input("Введіть 4-х значне число: "))

#num2 = str(num)

#if len (num2) != 4:
#    print("Ваше число не відповідає умовам")
#else:
#    n1 = num // 1000
#    n2 = num % 1000 // 100
#    n3 = num % 1000 % 100 // 10
#    n4 = num % 1000 % 100 % 10
#    print(f"\n{n1} \n{n2} \n{n3} \n{n4}")






